       01 ACCOUNT-RECORD.
           05 ACC-NUMBER         PIC X(10).
           05 ACC-CUSTOMER-ID    PIC X(7).
           05 ACC-TYPE           PIC X(10).
           05 ACC-BALANCE        PIC 9(9)V99.
           05 ACC-OPEN-DATE      PIC 9(8).
           