       01 CUSTOMER-RECORD.
           05 CUST-ID            PIC X(7).
           05 CUST-LAST-NAME     PIC X(20).
           05 CUST-FIRST-NAME    PIC X(20).
           05 CUST-CITY          PIC X(20).
           05 CUST-SEGMENT       PIC X(10).