       01 TRANSACTION-RECORD.
           05 TXN-ID             PIC X(9).
           05 TXN-DATE           PIC 9(8).
           05 TXN-TYPE           PIC X(8).
           05 TXN-SOURCE-ACC     PIC X(10).
           05 TXN-TARGET-ACC     PIC X(10).
           05 TXN-AMOUNT         PIC 9(9)V99.
           